{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "hi",
        "hello",
        "hey",
        "howdy",
        "hi there",
        "greetings",
        "good day"
      ],
      "responses": [
        "Hello! Welcome to KFC! How can I assist you today?",
        "Hi! What can I get for you today?",
        "Hey! What's up? How can I help you?",
        "Greetings! Welcome to KFC. How may I assist you?",
        "Good day! It's a pleasure to have you at KFC. What can I do for you?"
      ]
    },
    {
      "tag": "menu",
      "patterns": [
        "menu",
        "what's on the menu?",
        "food options",
        "show me the menu",
        "menu choices",
        "dishes"
      ],
      "responses": [
        "Sure, here is our menu:\n\nChicken Buckets:\n* Original Recipe Bucket\n* Extra Crispy Bucket\n* Zinger Bucket\n* Popcorn Chicken Bucket\n\nBurgers:\n* Zinger Stacker\n* Original Recipe Sandwich\n* Extra Crispy Sandwich\n* Chunky Chicken Sandwich\n\nSandwiches:\n* Twister Wrap\n* Colonel's Original Recipe Chicken Sandwich\n* Zinger Sandwich\n* Chipotle Chicky Sandwich\n\nSides:\n* Mashed Potatoes and Gravy\n* Coleslaw\n* Biscuits\n* Macaroni and Cheese\n\nDesserts:\n* Apple Pie\n* Chocolate Chip Cookie\n* Ice Cream Sundae\n* Waffle Cone\n\nWhat would you like to order?"
      ]
    },
    {
      "tag": "order",
      "patterns": [
        "I'd like to order",
        "Can I get",
        "I want",
        "order now",
        "place my order"
      ],
      "responses": [
        "Great! What would you like to order? Please specify the item and any customizations you prefer.",
        "Sure, what can I get for you today?",
        "What would you like to order? Please let me know.",
        "Ready to place your order! What can I get for you?",
        "Certainly! What dish are you in the mood for today? Let me know, and I'll take your order."
      ]
    },
    {
      "tag": "reservation",
      "patterns": [
        "book a table",
        "reservation",
        "reserve a table",
        "table booking",
        "reserve for dinner",
        "book for a group"
      ],
      "responses": [
        "Certainly! For how many people and at what time would you like to make a reservation?",
        "I can help you with that. For how many people and at what time would you like to make a reservation?",
        "Sure, I can make a reservation for you. For how many people and at what time would you like to make a reservation?",
        "Thinking about a special dinner? I can assist with a table reservation. For when and for how many guests?",
        "Great choice! How many people will be joining you, and at what time would you like the reservation?"
      ]
    },
    {
      "tag": "opening_hours",
      "patterns": [
        "opening hours",
        "when do you open?",
        "closing time",
        "hours of operation",
        "working hours"
      ],
      "responses": [
        "We are open from 10 am to 10 pm every day. We look forward to serving you!",
        "Our opening hours are from 10 am to 10 pm every day.",
        "We are open from 10 am to 10 pm every day. Welcome!",
        "Our doors are open from 10 am to 10 pm. Feel free to drop by!",
        "Planning your visit? We welcome you between 10 am and 10 pm every day. See you soon!"
      ]
    },
    {
      "tag": "specials",
      "patterns": [
        "specials",
        "today's specials",
        "chef's recommendations",
        "special offers",
        "featured dishes"
      ],
      "responses": [
        "Our specials today include the Zinger Stacker burger, the Twister wrap, and the KFC bucket for one. What can I get for you today?",
        "Our specials today are the Zinger Stacker burger, the Twister wrap, and the KFC bucket for one. Would you like to try one of those?",
        "Our chef's recommendations today are the Zinger Stacker burger, the Twister wrap, and the KFC bucket for one. What can I get for you today?",
        "Exciting specials await you! Check out the Zinger Stacker, Twister wrap, and the KFC bucket for one.",
        "Curious about our chef's picks? Today's specials feature the Zinger Stacker, Twister wrap, and the KFC bucket for one."
      ]
    },
    {
      "tag": "payment",
      "patterns": [
        "payment options",
        "how can I pay?",
        "credit cards accepted",
        "accepted payment methods",
        "paying for the order"
      ],
      "responses": [
        "We accept cash, credit cards, and mobile payments. You can choose the payment method that suits you best.",
        "You can pay with cash, credit cards, or mobile payments.",
        "We accept all major credit cards.",
        "Convenient payment options available - cash, credit cards, and mobile payments."
      ]
    },
    {
      "tag": "location",
      "patterns": [
        "where are you located?",
        "address",
        "directions",
        "find your restaurant",
        "nearest KFC",
        "what is your address",
        "what is your location"
      ],
      "responses": [
        "We are located at 123 Main Street, Cityville, Country.",
        "Our address is 123 Main Street, Cityville, Country. Visit us soon!",
        "Find us at 123 Main Street, Cityville, Country. We look forward to serving you!",
        "Looking for directions? We are at 123 Main Street, Cityville, Country. See you soon!"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "goodbye",
        "bye",
        "see you later",
        "thanks",
        "farewell"
      ],
      "responses": [
        "Thank you for visiting us. See you soon!",
        "Have a great day. See you soon!"
      ]
    }
  ]
}
